export default {
  translation: {
    dice: {
      roll: 'Бросить кубик',
      bot: '*ходит бот*',
    },
    wait: 'Подождите...',
    play: 'Начать игру',
    gameEndedForPlayer: 'Игрок "{{name}}" добрался до финиша!',
    modals: {
      continueButton: 'Понял-принял',
      rules: {
        title: 'Змеи и лестницы — увлекательная настольная игра! Игроки кидают кубик и ходят по игровому полю. Победит тот, кто быстрее остальных доберется до финиша.',
        ladder: 'Игрок передвигается от начала лестницы к ее верху',
        snake: 'При попадании на голову змеи игрок спускается к ее хвосту',
        coffin: 'При попадании на гроб игрок перемещается в начало доски',
        praiseHands: 'Игрок получает дополнительную жизнь-антидот, спасающую его от змеи',
        snakesNest: 'При попадании на гнездо змей на доске появляется дополнительная змея',
      },
      endGame: {
        title: 'Игра окончена',
        restart: 'Начать заново',
      },
      selectGameMode: {
        title: 'Выбери режим',
        vsBot: 'Сыграть с ботом',
        vsPlayer: 'Сыграть с другом',
      },
      soundCheck: {
        title: 'Рекомендуем играть в наушниках для максимального погружения.',
        muted: 'Судя по всему, вы открыли игру через мобильный браузер. Для максимального погружения рекомендуем играть в наушниках и на компьютере. Сейчас звук выключен, чтобы вы не оказались в неловкой ситуации ;)',
        soundOn: 'Играть со звуком!',
        ignore: 'Играть втихую',
      },
      promo: {
        greeting: {
          title: 'Привет, дружище!',
          part1: 'Тебя приветствует',
          part2: ' & Ко. Мы написали эту игру в поддержку моего первого микстейпа «Змеи и Лестницы».',
          part3: 'Предлагаю тебе ПАРИ! Сейчас мы сыграем одну партейку, параллельно можно будет слушать сниппет релиза. Если',
          part4: 'выиграешь ты',
          part5: 'я предложу тебе поучаствовать',
          part6: 'в конкурсе с денежными призами',
          part7: 'и не только. Если же победа будет за мной — ты поддержишь меня и мой микстейп «Змеи и Лестницы». После этого можно будет сыграть еще раз, если захочешь.',
          part8: 'Будем рады, если найдешь и сообщишь нам о багах ;)',
          go: 'Играем!',
        },
        endGame: {
          grats: 'Ты победил, грац! Как и обещал, КОНКУРС',
          relief: 'Тебе не удалось победить, но не беда! С тебя, конечно же, обещанная поддержка, НО мы хотели бы, чтобы ты также мог принять участие в конкурсе ;)',
          contest: {
            conditions: {
              title: 'Условия конкурса будут указаны в паблике VK.',
              subscribe: 'Подпишись!',
            },
            prize: {
              title: 'Призы',
              gold: '1 место:',
              silver: '2 место:',
              silverTail: 'и настольная игра «Змеи и лестницы» (вышлем почтой)',
              bronze: '3 место:',
              bronzeTail: 'и стихотворение / текст на заказ от меня',
            },
          }
        },
      },
    },
    clouds: {
      start: 'Бросай кубик!',
      coffin: 'Эх, сначала...',
      ladder: 'Йееехху-у-у~!',
      useAntidote: 'Колю антидот!',
      snake: 'Почему я !?',
      antidote: 'Ух ты, антидот!',
      finish: 'Ура, я первее!',
    },
  },
};
